; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 789621 2 1 2 8 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star5)
	(have_image Phenomenon8 infrared1)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
))

)

; plan
1. (turn_to satellite1 star5 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star5)
   goals met: 1 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 4
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 4
4. (turn_to satellite0 star10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star10)
   goals met: 1 of 4
5. (calibrate satellite1 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 1 of 4
6. (turn_to satellite0 phenomenon8 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon8)
   goals met: 1 of 4
7. (turn_to satellite1 star10 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star10)
   goals met: 0 of 4
8. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 4
9. (take_image satellite1 star10 instrument1 infrared0)
   added: (have_image star10 infrared0)
   goals met: 1 of 4
10. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 4
11. (turn_to satellite1 star5 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star5)
   goals met: 2 of 4
12. (turn_to satellite0 phenomenon8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 4
13. (take_image satellite0 phenomenon8 instrument0 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 3 of 4
14. (turn_to satellite1 planet9 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 planet9)
   goals met: 2 of 4
15. (turn_to satellite0 planet9 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet9)
   goals met: 2 of 4
16. (take_image satellite1 planet9 instrument1 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 3 of 4
17. (turn_to satellite1 star5 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star5)
   goals met: 4 of 4
